Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/CRC/crc.h
/**
 * @file crc.h
 * @brief CRC (Cyclic Redundancy Check) peripheral driver for STM32F429
 * @author Generated by GitHub Copilot
 * @date 2025
 *
 * This driver provides a comprehensive interface for the CRC peripheral
 * on STM32F429 microcontrollers. It supports various CRC standards,
 * configurable polynomials, and both hardware and software implementations
 * for data integrity verification.
 */

#ifndef CRC_H
#define CRC_H

#include "stm32f4xx.h"
#include <stdint.h>
#include <stdbool.h>

/* CRC Configuration Constants */
#define CRC_MAX_DATA_SIZE           1024U
#define CRC_DEFAULT_POLYNOMIAL      0x04C11DB7U
#define CRC_DEFAULT_INIT_VALUE      0xFFFFFFFFU

/* CRC Standard Polynomials */
#define CRC_POLY_CRC32              0x04C11DB7U  /* Standard CRC-32 */
#define CRC_POLY_CRC32C             0x1EDC6F41U  /* CRC-32C (Castagnoli) */
#define CRC_POLY_CRC16              0x8005U      /* CRC-16 */
#define CRC_POLY_CRC16_CCITT        0x1021U      /* CRC-16-CCITT */
#define CRC_POLY_CRC8               0x07U        /* CRC-8 */

/* CRC Input/Output Data Formats */
typedef enum {
    CRC_FORMAT_8BIT = 0U,
    CRC_FORMAT_16BIT = 1U,
    CRC_FORMAT_32BIT = 2U
} CRC_DataFormat;

/* CRC Calculation Methods */
typedef enum {
    CRC_METHOD_HARDWARE = 0U,      /* Use STM32 hardware CRC unit */
    CRC_METHOD_SOFTWARE = 1U       /* Software implementation */
} CRC_Method;

/* CRC Error Types */
typedef enum {
    CRC_ERROR_NONE = 0,
    CRC_ERROR_INVALID_PARAM = 1,
    CRC_ERROR_DATA_SIZE = 2,
    CRC_ERROR_HARDWARE = 3,
    CRC_ERROR_TIMEOUT = 4
} CRC_ErrorType;

/* CRC Configuration Structure */
typedef struct {
    CRC_Method method;                    /* Hardware or software calculation */
    uint32_t polynomial;                  /* CRC polynomial */
    uint32_t init_value;                  /* Initial CRC value */
    bool input_reverse;                   /* Reverse input data bytes */
    bool output_reverse;                  /* Reverse output CRC */
    CRC_DataFormat input_format;          /* Input data format */
    CRC_DataFormat output_format;         /* Output data format */
    bool xor_output;                      /* XOR output with this value */
    uint32_t xor_value;                   /* Value to XOR with output */
} CRC_Config;

/* CRC Status Structure */
typedef struct {
    bool initialized;                     /* Driver initialized flag */
    CRC_Method current_method;            /* Current calculation method */
    uint32_t last_calculated_crc;         /* Last calculated CRC value */
    CRC_ErrorType last_error;             /* Last error type */
    uint32_t calculation_count;           /* Total calculations performed */
    uint32_t hardware_usage_count;        /* Hardware CRC calculations */
    uint32_t software_usage_count;         /* Software CRC calculations */
} CRC_Status;

/* Function Prototypes */

/**
 * @brief Initialize the CRC peripheral with specified configuration
 * @param config Pointer to CRC configuration structure
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_Init(const CRC_Config *config);

/**
 * @brief Deinitialize the CRC peripheral
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_DeInit(void);

/**
 * @brief Calculate CRC for a data buffer
 * @param data Pointer to data buffer
 * @param size Size of data in bytes
 * @param crc Pointer to store calculated CRC value
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_Calculate(const uint8_t *data, uint32_t size, uint32_t *crc);

/**
 * @brief Calculate CRC for a 32-bit word array (hardware optimized)
 * @param data Pointer to 32-bit data array
 * @param size Number of 32-bit words
 * @param crc Pointer to store calculated CRC value
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_Calculate32(const uint32_t *data, uint32_t size, uint32_t *crc);

/**
 * @brief Accumulate CRC calculation (process data in chunks)
 * @param data Pointer to data buffer
 * @param size Size of data in bytes
 * @param crc Pointer to current CRC value (updated)
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_Accumulate(const uint8_t *data, uint32_t size, uint32_t *crc);

/**
 * @brief Reset CRC calculation state
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_Reset(void);

/**
 * @brief Get current CRC status
 * @param status Pointer to status structure
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_GetStatus(CRC_Status *status);

/**
 * @brief Set CRC polynomial (software method only)
 * @param polynomial New polynomial value
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_SetPolynomial(uint32_t polynomial);

/**
 * @brief Set CRC initial value
 * @param init_value New initial value
 * @return HAL_StatusTypeDef HAL status
 */
HAL_StatusTypeDef CRC_SetInitValue(uint32_t init_value);

/**
 * @brief Register callback for CRC calculation complete event
 * @param callback Function pointer to callback
 */
void CRC_RegisterCompleteCallback(void (*callback)(uint32_t crc_value));

/**
 * @brief Register callback for CRC error event
 * @param callback Function pointer to callback
 */
void CRC_RegisterErrorCallback(void (*callback)(CRC_ErrorType error));

/**
 * @brief Get CRC peripheral handle (for advanced usage)
 * @return CRC_HandleTypeDef* Pointer to CRC handle
 */
CRC_HandleTypeDef* CRC_GetHandle(void);

/**
 * @brief Get default CRC configuration
 * @param config Pointer to configuration structure to fill
 */
void CRC_GetDefaultConfig(CRC_Config *config);

#endif /* CRC_H */
